Revit 2021.1 API
Alignment.GetPointAtStation Method
 Calculates the model point for a given alignment station.
Namespace: Autodesk.Revit.DB.Infrastructure
Assembly: Autodesk.CivilAlignments.DBApplication (in Autodesk.CivilAlignments.DBApplication.dll) Version: 21.0.0.0 (21.1.1.109)
Since: 2021.1
Syntax
C#
public XYZ GetPointAtStation(
	double station
)
Visual Basic
Public Function GetPointAtStation ( _
	station As Double _
) As XYZ
Visual C++
public:
XYZ^ GetPointAtStation(
	double station
)
Parameters
station
Type: System.Double
The alignment station for which to calculate the point.
Return Value
The model point at the given alignment station.
See Also
Alignment Class
Autodesk.Revit.DB.Infrastructure Namespace